      ******************************************************************
      *    Author:                Lionbach (Leo Mumbach)
      *    Date:                  01/01/2024
      *    Objetive:
      *    Comments:
      ******************************************************************

      ******************** IDENTIFICATION DIVISION *********************
       IDENTIFICATION DIVISION.
       PROGRAM-ID.                PROG0001.

      ********************** ENVIRONMENT DIVISION **********************
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

      ************************* DATA DIVISION **************************
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

      *********************** PROCEDURE DIVISION ***********************
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY 'HELLO WORLD'.
           STOP RUN.
       END PROGRAM PROG0001.
