       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST6.
       DATE-WRITTEN. Oct 16, 2012.
       DATE-COMPILED.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 WS-CURRENT-DATE-DATA.
           05  WS-CURRENT-DATE.
               10  WS-CURRENT-YEAR         PIC 9(04).
               10  WS-CURRENT-MONTH        PIC 9(02).
               10  WS-CURRENT-DAY          PIC 9(02).
           05  WS-CURRENT-TIME.
               10  WS-CURRENT-HOURS        PIC 9(02).
               10  WS-CURRENT-MINUTE       PIC 9(02).
               10  WS-CURRENT-SECOND       PIC 9(02).
               10  WS-CURRENT-MILLISECONDS PIC 9(02).
           05 WS-DIFF-FROM-GMT             PIC 9(5).
       PROCEDURE DIVISION.
       MAIN-LINE SECTION.
           0000.
           PERFORM A-INIT.
           PERFORM B-MAIN.
           9999.
           STOP RUN.
       A-INIT SECTION.
           A-100.
       B-MAIN SECTION.
           B-100.
           MOVE FUNCTION CURRENT-DATE to WS-CURRENT-DATE-DATA
           DISPLAY WS-CURRENT-DATE-DATA.
           DISPLAY WS-DIFF-FROM-GMT.
           DISPLAY WS-CURRENT-DATE-DATA(17:5).
